{
  "format": "layers-model",
  "generatedBy": "keras v3.13.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_4",
        "trainable": true,
        "dtype": "float32",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer_4",
              "batch_input_shape": [
                null,
                28,
                28,
                1
              ]
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_4",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_12",
              "trainable": true,
              "dtype": "float32",
              "units": 50,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_13",
              "trainable": true,
              "dtype": "float32",
              "units": 50,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_14",
              "trainable": true,
              "dtype": "float32",
              "units": 10,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [
          null,
          28,
          28,
          1
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_12/kernel",
          "shape": [
            784,
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_12/bias",
          "shape": [
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_13/kernel",
          "shape": [
            50,
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_13/bias",
          "shape": [
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_14/kernel",
          "shape": [
            50,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_14/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
